modules/core/connection/modules.dot
digraph {
edge ["dir"="forward"]
graph ["dpi"="100","fontsize"="30","ranksep"="1.5","rankdir"="TB"]
node ["style"="filled"]
":account:model" ["fillcolor"="#9D8DF1","shape"="none"]
":api:actual" ["fillcolor"="#9D8DF1","shape"="none"]
":api:builder" ["fillcolor"="#9D8DF1","shape"="none"]
":budget:model" ["fillcolor"="#9D8DF1","shape"="none"]
":codegen:annotation" ["fillcolor"="#9D8DF1","shape"="none"]
":core:connection" ["fillcolor"="#9D8DF1","color"="black","penwidth"="3","shape"="box"]
":core:model" ["fillcolor"="#9D8DF1","shape"="none"]
":logging" ["fillcolor"="#9D8DF1","shape"="none"]
":prefs" ["fillcolor"="#9D8DF1","shape"="none"]
":api:actual" -> ":account:model"
":api:actual" -> ":budget:model"
":api:actual" -> ":codegen:annotation" ["style"="dotted"]
":api:actual" -> ":core:model"
":api:builder" -> ":core:model"
":api:builder" -> ":logging" ["style"="dotted"]
":core:connection" -> ":api:actual"
":core:connection" -> ":api:builder"
":core:connection" -> ":core:model" ["style"="dotted"]
":core:connection" -> ":logging" ["style"="dotted"]
":core:connection" -> ":prefs" ["style"="dotted"]
":prefs" -> ":account:model"
":prefs" -> ":core:model"
}
